---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShape.GetRebarShapeDefinition
source: html/80019bb8-76a4-f6e1-476d-2f9992286adb.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.GetRebarShapeDefinition Method

Return the definition of the RebarShape.

## Syntax (C#)
```csharp
public RebarShapeDefinition GetRebarShapeDefinition()
```

## Returns
A copy of the definition. Changes will not affect the RebarShape.

## Remarks
Replaces the property RebarShape.Definition from previous releases.